<template>
  <div class="privacy">
    <!-- 注册协议 -->
    <div class="wapper">
      <div class="title">
        <h1>红豆记用户注册协议</h1>
      </div>
      <div class="content">
        <div class="h2">{{title1}}</div>
        <div class="text">{{con1}}</div>
        <div class="h2">{{title2}}</div>
        <div class="con">
          <div v-for="(item, index) in con2" :key="index">
            <div class="text">{{item}}</div>
          </div>
        </div>
        <div class="h2">{{title3}}</div>
        <div class="con">
          <div v-for="(item, index) in con3" :key="index">
            <div class="text">{{item}}</div>
          </div>
        </div>
        <div class="h2">{{title4}}</div>
        <div class="text">{{con4}}</div>
        <div class="h2">{{title5}}</div>

        <div class="con">
          <div v-for="(item, index) in con5" :key="index">
            <div class="text">{{item}}</div>
          </div>
        </div>
        <div class="h2">{{title6}}</div>
        <div class="con">
          <div v-for="(item, index) in con6" :key="index">
            <div class="text">{{item}}</div>
          </div>
        </div>
        <div class="h2">{{title7}}</div>
        <div class="con">
          <div v-for="(item, index) in con7" :key="index">
            <div class="text">{{item}}</div>
          </div>
        </div>
        <div class="h2">{{title8}}</div>
        <div class="con">
          <div v-for="(item, index) in con8" :key="index">
            <div class="text">{{item}}</div>
          </div>
        </div>
        <div class="h2">{{title9}}</div>
        <div class="con">
          <div v-for="(item, index) in con9" :key="index">
            <div class="text">{{item}}</div>
          </div>
        </div>
        <div class="h2">{{title10}}</div>
        <div class="con">
          <div v-for="(item, index) in con10" :key="index">
            <div class="text">{{item}}</div>
          </div>
        </div>
        <div class="h2">{{title11}}</div>
        <div class="con">
          <div v-for="(item, index) in con11" :key="index">
            <div class="text">{{item}}</div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>


<script>
export default {
  layout: "none", // 切换另一个布局
  data() {
    return {
      title1: "一.协议条款的确认及接受",
      con1:
        '红豆记（包括网址为www.hdouji.com的网站，以及可在IOS 系统及Android 系统中运行的名为“红豆记”的应用程序，以下简称"本网站"或“红豆记”）由豆印有限公司（包括其关联机构，以下合称“本公司”）运营并享有完全的所有权及知识产权等权益，本网站提供的服务将完全按照其发布的条款和操作规则严格执行。您确认同意本协议（协议文本包括《红豆记用户注册协议》、《红豆记用户隐私政策》、《红豆记社区规范》，三者乃不可分割的整体，具有同等法律效力，共同构成用户使用本网站及相关服务的整体协议，以下合称“本协议”）所有条款并完成注册程序时，本协议在您与本公司间成立并发生法律效力，同时您成为本网站正式用户。',
      title2: "二.账号注册及使用规则",
      con2: [
        `2.1用户注册成功后，红豆记将给予每个用户一个用户帐号及相应的密码，该用户帐号和密码由用户负责保管；用户应当对以其用户帐号进行的所有活动和事件负法律责任。`,
        `2.2用户须对在红豆记的注册信息的真实性、合法性、有效性承担全部责任，用户不得冒充他人（包括但不限于冒用他人姓名、名称、字号、头像等足以让人引起混淆的方式）开设账号；不得利用他人的名义发布任何信息；不得恶意使用注册帐户导致其他用户误认；否则红豆记有权立即停止提供服务，收回其帐号并由用户独自承担由此而产生的一切法律责任。`,
        `2.3用户理解且确认，其在红豆记注册账号的所有权及有关权益均归本公司所有，用户完成注册手续后仅享有该账号的使用权。您的账号仅限于您本人使用，未经本公司书面同意，禁止以任何形式赠与、借用、出租、转让、售卖或以其他方式许可他人使用该账号。如果本公司发现或者有合理理由认为使用者并非账号初始注册人，公司有权在未通知您的情况下，暂停或终止向该注册账号提供服务，并有权注销该账号，而无需向注册该账号的用户承担法律责任。 `,
        `2.4为了充分使用账号资源，如用户在注册后未及时进行初次登录使用或连续超过二个月未登录账号并使用等情形，本公司有权收回用户的注册账号。 `,
        `2.5用户承诺不得以任何方式利用红豆记直接或间接从事违反中国法律、以及社会公德的行为，红豆记有权对违反上述承诺的内容予以删除。`,
        `2.6用户不得利用本网站制作、上载、复制、发布、传播或者转载如下内容： （1）反对宪法所确定的基本原则的；（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；（3）损害国家荣誉和利益的；（4）煽动民族仇恨、民族歧视，破坏民族团结的；（5）破坏国家宗教政策，宣扬邪教和封建迷信的；（6）散布谣言，扰乱社会秩序，破坏社会稳定的；（7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；（8）侮辱或者诽谤他人，侵害他人合法权益的；（9）含有法律、行政法规禁止的其他内容的信息。`,
        `2.7红豆记鼓励用户充分利用红豆记平台自由地发布和共享自己的信息，用户对于其创作并在红豆记上发布的合法内容（包括但不限于文字、图片、视频、音频等）依法享有著作权。用户不应通过红豆记发布他人受知识产权法律等保护的内容，除非获得他人的合法授权。就用户发布的内容，若第三方向红豆记投诉并提交初步证据，经红豆记判断投诉属实的，红豆记将会删除这些内容。如因用户发布的内容给红豆记带来损失的，用户应当负责赔偿。（关于用户在红豆记发布内容的具体规范，请查阅《红豆记社区规范》）。 `,
        `2.8红豆记有权对用户使用红豆记的情况进行审查和监督，如用户在使用红豆记时违反任何上述规定，红豆记或其授权的人有权要求用户改正或直接采取一切必要的措施（包括但不限于更改或删除用户张贴的内容、暂停或终止用户使用红豆记的权利）以减轻用户不当行为造成的影响。 `
      ],
      title3: "三.服务内容",
      con3: [
        `3.1本网站的服务具体内容根据实际情况提供，红豆记保留变更、中断或终止部分或全部服务的权利。红豆记不承担因业务调整给用户造成的损失。除非本协议另有其它明示规定，增加或强化目前本网站的任何新功能，包括所推出的新产品，均受到本协议之规范。用户了解并同意，本网站服务仅依其当前所呈现的状况提供，对于任何用户通讯或个人化设定之时效、删除、传递错误、未予储存或其它任何问题，红豆记均不承担任何责任。`,
        `3.2红豆记在提供服务时，可能会对部分服务的用户收取一定的费用。在此情况下，红豆记会在相关页面上做明确的提示。如用户拒绝支付该等费用，则不能使用相关的服务。`,
        `3.3用户理解，红豆记仅提供相关的服务，除此之外与相关服务有关的设备（如电脑、调制解调器及其他与接入互联网有关的装置）及所需的费用（如为接入互联网而支付的电话费及上网费）均应由用户自行负担。`,
        `3.4红豆记提供的服务内容可能包括：文字、软件、声音、图片、视频、图表等。所有这些内容受著作权、商标和其它财产所有权法律的保护。用户只有在获得红豆记或其他相关权利人的授权之后才能使用这些内容，不能擅自复制、再造这些内容、或创造与内容有关的派生产品。`,
        `3.5红豆记会员服务`,
        `3.5.1红豆记会员，是指在红豆记具有良好消费记录的个人注册用户根据红豆记公布的收费标准支付相应的费用后获取的特殊资格。以下称“会员”。`,
        `3.5.2会员服务，指会员享有的特殊服务，包括以相对优惠的价格购买指定商品（即会员专享价），以及其他由红豆记明示的优惠措施。用户开通会员服务时，须按照红豆记公布的收费标准支付相应的会员服务费用。基于业务的发展，红豆记有权调整收费标准，调整后的收费标准自公布之日起生效。`,
        `3.5.3会员知悉并确认，当开通会员服务后，若您中途取消服务或终止资格的，红豆记将不退还您已支付的会员服务费用。`,
        `3.5.4使用会员服务过程中，您应当是具备完全民事权利能力和完全民事行为能力的自然人、法人或其他组织。若您不具备前述主体资格，则您及您的监护人应当承担因此而导致的一切后果，红豆记有权向您的监护人追偿。`,
        `3.5.5您知悉并同意，红豆记有权通邮件、短信等方式，向您发送会员相关活动的信息；`,
        `3.5.6您确认会员服务仅限您本人使用，同时，您保证，您将合理使用会员服务，不会利用会员服务非法获利，不以任何形式转让您所享有的会员服务，不以任何形式将您所享有的会员服务借给他人使用，如红豆记有合理理由怀疑您存在不当使用会员服务时，红豆记有权取消您的会员资格且不退还您支付的会员服务费用，因此产生的相关责任及损失均由您自行承担，给红豆记造成损失的，红豆记保留向您追偿的权利。`,
        `3.5.7红豆记保留在法律法规允许的范围内自行决定是否接受您的会员服务申请、调整会员服务内容、取消会员资格等权利。`,
        `3.6商品/服务的购买与评价`,
        `3.6.1您可以通过红豆记商城购买红豆记或者第三方商家为您提供的商品/服务，商品/服务来源以是否标注“自营”予以区分。`,
        `3.6.2您在红豆记下订单时，请您仔细确认所购商品的名称、价格、数量、型号、规格、尺寸、联系地址、电话、收货人等信息。收货人与您本人不一致的，收货人的行为和意思表示视为您的行为和意思表示，您应对收货人的行为及意思表示的法律后果承担连带责任。`,
        `3.6.3您理解并同意：红豆记上展示的商品/服务和价格等信息为向您发出的要约。您下单时须填写您希望购买的商品/服务数量、价款及支付方式、收货人、联系方式、收货地址等内容；付款及订单提交成功前，您有权修改所填信息。付款及订单提交成功后，将视您与销售商之间就您购买的商品/服务成立了合同关系，销售商会按照您在订单中订购的商品/服务进行发货。 `,
        `3.6.4尽管销售商做出最大的努力，但由于市场变化及各种以合理商业努力难以控制因素的影响，本软件无法避免您提交的订单信息中的商品出现缺货情况；如您下单所购买的商品发生缺货，您有权取消订单以解除电子合同，销售商在取得您同意的前提下可以取消订单以解除电子合同，若您已经付款，则为您办理退款。 `,
        `3.6.5用户有权在红豆记提供的评价系统中对与其达成交易的商品/服务进行评价。用户的评价内容应当客观真实，不应包含任何污言秽语、色情低俗、恶意贬低及法律法规与本协议列明的其他禁止性信息；用户不应以不正当方式帮助商家提升销量、信用或利用评价权利对相关商家进行恐吓、敲诈勒索等违法行为。红豆记可按照本协议及相关法律法规的规定对用户实施上述行为所产生的评价信息进行删除或屏蔽 `
      ],
      title4: "四.知识产权",
      con4: `本公司在“红豆记”软件及相关服务中提供的内容（包括但不限于软件、技术、程序、网页、文字、图片、图像、商标、标识、音频、视频、图表、版面设计、电子文档等）的知识产权属于本公司所有。同时本公司提供服务所依托的软件的著作权、专利权、商标及其他知识产权均归本公司所有。未经本公司许可，任何人不得擅自使用（包括但不限于通过任何机器人、蜘蛛等程序或设备监视、复制、传播、展示、镜像、上载、下载“红豆记”软件及相关服务中的内容）。`,
      title5: "五.用户授权及隐私保护",
      con5: [
        `5.1用户知悉、理解并同意其通过红豆记发布上传的内容，授权本公司及其关联公司、控制公司可在全球范围内、免费、非独家、可转授权地使用，使用范围包括但不限于在当前或其他网站、应用程序、产品或终端设备等，并授权公司及其关联公司、控制公司对相应内容可进行修改、复制、改编、翻译、汇编或制作衍生产品。 `,
        `5.2用户确认并同意授权本公司以公司名义或委托专业第三方对侵犯用户上传发布的享有知识产权的内容进行代维权，维权形式包括但不限于：监测侵权行为、发送维权函、提起诉讼或仲裁、调解、和解等，本公司有权对维权事宜做出决策并独立实施。 `,
        `5.3保护用户隐私是红豆记的一项基本政策，红豆记保证不对外公开或向第三方提供用户注册资料及用户在使用本网站服务时存储在红豆记的非公开内容，但下列情况除外： （1）事先获得用户的明确授权；（2）根据有关的法律法规要求；（3）按照相关政府主管部门的要求；（4）为维护社会公众的利益；（5）维护红豆记的合法权益。`,
        `5.4在获得您授权的情况下，红豆记可能会与第三方合作向用户提供相关的服务，在此情况下，如该第三方同意承担与红豆记同等的保护用户隐私的责任，则红豆记可将用户的注册资料等提供给该第三方。 `,
        `5.5在不透露单个用户隐私资料的前提下，红豆记有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。`,
        `5.6红豆记将采取先进的技术手段、严密的内控制度等保护用户的隐私信息，关于用户隐私信息的收集、使用、存储及披露等，详见《红豆记用户隐私政策》。`,
        `5.7用户关注信息公开：红豆记提供的某些服务项目中有“关注”功能，用户选择“关注”后，可以在“我的关注”中查看自己关注的信息，包括关注的“用户”、“商家”、“标签”、“专辑”等，用户须知，红豆记平台对用户关注的项目是公开的，即其他用户可以查看到该用户关注的项目。另外用户可以在“设置”-“隐私设置”中调整“评论设置”、“通讯录设置”“微博设置”等，自行调整评论、以及添加好友的方式等。 `,
        `5.8用户可以向红豆记申请注销账户。用户注销账户后，红豆记将停止为其提供产品/服务，并依据用户的要求，除法律法规另有规定外，红豆记将删除其在红豆记平台上的个人信息。`
      ],
      title6: "六.免责声明",
      con6: [
        `6.1用户将照片、个人信息等资料上传到互联网上，有可能会被其他组织或个人复制、转载、擅改或做其它非法用途，用户必须充分意识此类风险的存在。用户明确同意其使用红豆记服务所存在的风险（包括但不限于受到第三方侵权或对第三方造成侵权）完全由其自己承担；因其使用红豆记服务而产生的一切后果也由其自己承担，红豆记对此不承担任何责任。 `,
        `6.2红豆记不担保本网站服务一定能满足用户的要求，也不担保本网站服务不会中断，对本网站服务的及时性、安全性、准确性、真实性、完整性也都不作担保。`,
        `6.3对于因不可抗力或红豆记不能控制的原因造成的本网站服务中断或其它缺陷，红豆记不承担任何责任，但红豆记将尽力减少因此而给用户造成的损失和影响。`,
        `6.4根据有关法律法规，红豆记在此郑重提请用户注意，红豆记作为信息存储空间及网络交易平台的提供者，任何经由本网站以上载、张贴、发送电子邮件或任何其它方式传送的资讯、资料、文字、软件、音乐、音讯、照片、图形、视讯、信息或其它资料（以下简称“内容”），无论系公开还是私下传送，均由内容提供者承担责任。红豆记无法控制经由本网站传送之内容，因此不保证内容的正确性、完整性或品质。在任何情况下，红豆记均不为任何内容负责，包含但不限于任何内容之任何错误或遗漏，以及经由本网站服务以张贴、发送电子邮件或其它方式传送任何内容而衍生之任何损失或损害。但红豆记有权依法停止传输任何前述内容并采取相应行动，包括但不限于暂停用户使用本网站服务的全部或部分，保存有关记录，并向有关机关报告。`,
        `6.5红豆记作为网络服务提供者，对非法转载，虚假发布、盗版行为的发生不具备充分的监控能力。红豆记对他人在网站上实施的此类侵权行为不承担法律责任，侵权的法律责任概由本人承担。`
      ],
      title7: "七.使用TalkingData分析服务详述",
      con7: [
        `7.1TalkingData为移动应用提供数据统计分析服务，通过您在应用中集成了TalkingData数据SDK或API后，您的应用将通过技术手段收集和传送您终端用户的相关数据，通过我们的服务来分析这些数据以了解您的应用在不同终端设备上、使用平台或应用分发渠道的表现和用户使用的情况。 `,
        `7.2您终端用户的数据通常包括但不限于：SDK或API版本、平台、时间戳、应用标识符、应用程序版本、应用分发渠道、iOS供应商标识符（IDFV)、iOS广告标识符（IDFA)、安卓广告主标识符、网卡（MAC)地址、国际移动设备识别码（IMEI）、设备型号、终端制造厂商、终端设备操作系统版本、会话启动/停止时间、语言所在地、移动网络/国家代码、时区和网络状态（WiFi等）、硬盘、CPU和电池使用情况等。 `,
        `7.3根据您移动应用的类型和和您对统计分析选项的要求，您终端用户的数据还有可能包括：使用者性别、年龄、地理位置、用户触发特定事件、错误报告和页面浏览量等等。 `,
        `7.4为实现分析服务之目的，TalkingData分析服务将通过您的应用将上述数据发送到TalkingData的服务器上，由TalkingData以聚合性数据和分析报表的形式展现，您可以通过登陆在我们网站中的账户查阅相关统计和分析结果。`
      ],
      title8: "八.违约责任",
      con8: [
        `8.1针对用户违反本协议或其他服务条款的行为，本公司有权独立判断并视情况采取预先警示、拒绝发布、立即停止传输信息、删除跟帖、短期禁止发言、限制账号部分或者全部功能直至永久关闭账号等措施。本公司有权公告处理结果，且有权根据实际情况决定是否恢复使用。对涉嫌违反法律法规、涉嫌违法犯罪的行为将保存有关记录，并依法向有关主管部门报告、配合有关主管部门调查。`,
        `8.2因用户违反本协议或其他服务条款规定，引起第三方投诉或诉讼索赔的，用户应当自行承担全部法律责任。因用户的违法或违约行为导致公司及其关联公司、控制公司向任何第三方赔偿或遭受国家机关处罚的，用户还应足额赔偿公司及其关联公司、控制公司因此遭受的全部损失。`
      ],
      title9: "九.未成年人使用条款",
      con9: [
        `9.1若用户是未满18周岁的未成年人，应在监护人监护、指导并获得监护人同意情况下阅读本协议和使用红豆记相关服务。`,
        `9.2本公司重视对未成年人个人信息的保护，未成年用户在填写个人信息时，请加强个人保护意识并谨慎对待，请在监护人指导时正确使用红豆记相关服务。`,
        `9.3未成年用户理解如因用户违反法律法规、本协议内容，则用户及用户的监护人应依照法律规定承担因此而导致的一切后果。`
      ],
      title10: "十.协议修改",
      con10: [
        `10.1红豆记有权根据法律、国家有权机构或公司经营要求修改本协议的有关条款，红豆记将会通过适当方式在网站上予以公示。`,
        `10.2如果不同意红豆记对本协议相关条款所做的修改，用户有权停止使用本网站服务。如果用户继续使用本网站服务，则视为用户接受红豆记对本协议相关条款所做的修改。`
      ],
      title11: "十一.法律管辖适用及其他",
      con11: [
        `11.1如您与本公司就本协议的订立、执行和解释及争议的解决均应适用中华人民共和国（不包括香港、澳门特别行政区，以及台湾地区）法律。如双方就本协议内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均应向上海市黄浦区人民法院提起诉讼。 `,
        `11.2如果本协议中任何一条被视为废止、无效或因任何理由不可执行，该条应视为可分的且并不影响任何其余条款的有效性和可执行性。`
      ]
    };
  }
};
</script>

<style lang="scss" scoped>

.privacy {
  padding: 4rem 10%;
  .h2 {
    font-size: 1.5rem;
    color: #333;
    line-height: 2.5;
    font-weight: 600;
  }
  .text {
    text-indent: 2rem;
    line-height: 1.5;
  }
  .title {
    text-align: center;
    h1 {
      font-size: 2rem;
      color: #333;
      margin-bottom:4rem;
    }
  }
}
</style>